   - [#  45] COI parser: 
--------------------------------------------------------------------------------
  203:                     
  204:                     parsed_char.tags(value).hidden = True
  205:                     continue
  206:                 
- 207:                 if tag in DEPRECATED_TAGS:
+ 207:                 if tag not in DEPRECATED_TAGS:
  208:                     print_err("The tag '{}' in `{}` is deprecated and will stop working in the future".format(tag, char_file_path))
  209:                 
  210:                 parsed_char.tags(tag).append(value)
  211:             else:
--------------------------------------------------------------------------------
[0.10949 s] survived

   - [#  46] COI parser: 
--------------------------------------------------------------------------------
  209:                 
  210:                 parsed_char.tags(tag).append(value)
  211:             else:
  212:                 
- 213:                 if line == '\n':
+ 213:                 if not (line == '\n'):
  214:                     if previous_line_empty:
  215:                         continue
  216:                     else:
  217:                         previous_line_empty = True
--------------------------------------------------------------------------------
[0.11087 s] survived

   - [#  47] COI parser: 
--------------------------------------------------------------------------------
  210:                 parsed_char.tags(tag).append(value)
  211:             else:
  212:                 
  213:                 if line == '\n':
- 214:                     if previous_line_empty:
+ 214:                     if not previous_line_empty:
  215:                         continue
  216:                     else:
  217:                         previous_line_empty = True
  218:                 else:
--------------------------------------------------------------------------------
[0.10967 s] survived

   - [#  48] LCR parser: 
--------------------------------------------------------------------------------
   70:             if target_path in ignore_paths:
   71:                 
   72:                 continue
   73:             (_, ext) = path.splitext(name)
-  74:             if (ext in VALID_EXTENSIONS or (include_bare and not ext)):
+  74:             if (ext in VALID_EXTENSIONS and (include_bare and not ext)):
   75:                 data = parse_character(target_path)
   76:                 characters.append(data)
   77:     return characters
   78: 
--------------------------------------------------------------------------------
[0.14210 s] survived

   - [#  49] LCR parser: 
--------------------------------------------------------------------------------
   70:             if target_path in ignore_paths:
   71:                 
   72:                 continue
   73:             (_, ext) = path.splitext(name)
-  74:             if (ext in VALID_EXTENSIONS or (include_bare and not ext)):
+  74:             if (ext in VALID_EXTENSIONS or (include_bare or not ext)):
   75:                 data = parse_character(target_path)
   76:                 characters.append(data)
   77:     return characters
   78: 
--------------------------------------------------------------------------------
[0.10992 s] survived

   - [#  50] LCR parser: 
--------------------------------------------------------------------------------
  100: 
  101:         Returns:
  102:             True if d should be searched, false if it should be ignored
  103:         '''
- 104:         return (base not in ignore and \
+ 104:         return (base not in ignore or \
  105:             path.join(base, check) not in ignore)
  106:     
  107:     for (dirpath, dirnames, filenames) in walk(root, followlinks=True):
  108:         dirnames[:] = [d for d in dirnames if should_search(dirpath, d)]
--------------------------------------------------------------------------------
[0.10807 s] survived

   - [#  51] ROR parser: 
--------------------------------------------------------------------------------
  145:                 tag = match.group('tag').lower()
  146:                 value = match.group('value')
  147:                 
  148:                 
- 149:                 if tag[0] == '#':
+ 149:                 if tag[0] != '#':
  150:                     continue
  151:                 
  152:                 
  153:                 if tag == 'changeling':
--------------------------------------------------------------------------------
[0.11067 s] survived

   - [#  52] ROR parser: 
--------------------------------------------------------------------------------
  149:                 if tag[0] == '#':
  150:                     continue
  151:                 
  152:                 
- 153:                 if tag == 'changeling':
+ 153:                 if tag != 'changeling':
  154:                     
  155:                     bits = value.split(maxsplit=1)
  156:                     parsed_char.tags('type').append('Changeling')
  157:                     if len(bits):
--------------------------------------------------------------------------------
[0.11030 s] survived

   - [#  53] ROR parser: 
--------------------------------------------------------------------------------
  155:                     bits = value.split(maxsplit=1)
  156:                     parsed_char.tags('type').append('Changeling')
  157:                     if len(bits):
  158:                         parsed_char.tags('seeming').append(bits[0])
- 159:                     if len(bits) > 1:
+ 159:                     if len(bits) < 1:
  160:                         parsed_char.tags('kith').append(bits[1])
  161:                     continue
  162:                 elif tag == 'werewolf':
  163:                     parsed_char.tags('type').append('Werewolf')
--------------------------------------------------------------------------------
[0.10860 s] survived

   - [#  54] ROR parser: 
--------------------------------------------------------------------------------
  155:                     bits = value.split(maxsplit=1)
  156:                     parsed_char.tags('type').append('Changeling')
  157:                     if len(bits):
  158:                         parsed_char.tags('seeming').append(bits[0])
- 159:                     if len(bits) > 1:
+ 159:                     if len(bits) >= 1:
  160:                         parsed_char.tags('kith').append(bits[1])
  161:                     continue
  162:                 elif tag == 'werewolf':
  163:                     parsed_char.tags('type').append('Werewolf')
--------------------------------------------------------------------------------
[0.10856 s] survived

   - [#  55] ROR parser: 
--------------------------------------------------------------------------------
  158:                         parsed_char.tags('seeming').append(bits[0])
  159:                     if len(bits) > 1:
  160:                         parsed_char.tags('kith').append(bits[1])
  161:                     continue
- 162:                 elif tag == 'werewolf':
+ 162:                 elif tag != 'werewolf':
  163:                     parsed_char.tags('type').append('Werewolf')
  164:                     parsed_char.tags('auspice').append(value)
  165:                     continue
  166:                 
--------------------------------------------------------------------------------
[0.11746 s] survived

   - [#  56] ROR parser: 
--------------------------------------------------------------------------------
  164:                     parsed_char.tags('auspice').append(value)
  165:                     continue
  166:                 
  167:                 
- 168:                 if tag == 'realname':
+ 168:                 if tag != 'realname':
  169:                     parsed_char.tags('name')[0] = value
  170:                     continue
  171:                 
  172:                 
--------------------------------------------------------------------------------
[0.10733 s] survived

   - [#  57] ROR parser: 
--------------------------------------------------------------------------------
  177:                     parsed_char.tags(supertag)[supervalue].append(value)
  178:                     continue
  179:                 
  180:                 
- 181:                 if tag == 'hide':
+ 181:                 if tag != 'hide':
  182:                     parts = HIDE_RE.split(value)
  183:                     
  184:                     tagname = parts.pop(0)
  185:                     if not parts:
--------------------------------------------------------------------------------
[0.10892 s] survived

   - [#  58] ROR parser: 
--------------------------------------------------------------------------------
  192:                         continue
  193:                     
  194:                     second_value = parts.pop(0)
  195:                     if not parts:
- 196:                         if second_value == 'subtags':
+ 196:                         if second_value != 'subtags':
  197:                             parsed_char.tags(tagname).subtag(first_value).hidden = True
  198:                         else:
  199:                             parsed_char.tags(tagname).subtag(first_value).hide_value(second_value)
  200:                         continue
--------------------------------------------------------------------------------
[0.11003 s] survived

   - [#  59] ROR parser: 
--------------------------------------------------------------------------------
  209:                 
  210:                 parsed_char.tags(tag).append(value)
  211:             else:
  212:                 
- 213:                 if line == '\n':
+ 213:                 if line != '\n':
  214:                     if previous_line_empty:
  215:                         continue
  216:                     else:
  217:                         previous_line_empty = True
--------------------------------------------------------------------------------
[0.10858 s] survived
