   - [#  48] CRP parser: 
--------------------------------------------------------------------------------
   11: from pathlib import Path
   12: from npc import character
   13: from npc.util import print_err
   14: 
-  15: VALID_EXTENSIONS = ('.nwod', '.dnd3', '.dfrpg')
+  15: VALID_EXTENSIONS = ('mutpy', '.dnd3', '.dfrpg')
   16: '''tuple: file extensions that should be parsed'''
   17: 
   18: DEPRECATED_TAGS = ('hidegroup', 'hideranks')
   19: 
--------------------------------------------------------------------------------
[0.00425 s] survived

   - [#  49] CRP parser: 
--------------------------------------------------------------------------------
   11: from pathlib import Path
   12: from npc import character
   13: from npc.util import print_err
   14: 
-  15: VALID_EXTENSIONS = ('.nwod', '.dnd3', '.dfrpg')
+  15: VALID_EXTENSIONS = ('', '.dnd3', '.dfrpg')
   16: '''tuple: file extensions that should be parsed'''
   17: 
   18: DEPRECATED_TAGS = ('hidegroup', 'hideranks')
   19: 
--------------------------------------------------------------------------------
[0.00448 s] survived

   - [#  50] CRP parser: 
--------------------------------------------------------------------------------
   11: from pathlib import Path
   12: from npc import character
   13: from npc.util import print_err
   14: 
-  15: VALID_EXTENSIONS = ('.nwod', '.dnd3', '.dfrpg')
+  15: VALID_EXTENSIONS = ('.nwod', 'mutpy', '.dfrpg')
   16: '''tuple: file extensions that should be parsed'''
   17: 
   18: DEPRECATED_TAGS = ('hidegroup', 'hideranks')
   19: 
--------------------------------------------------------------------------------
[0.00469 s] survived

   - [#  51] CRP parser: 
--------------------------------------------------------------------------------
   11: from pathlib import Path
   12: from npc import character
   13: from npc.util import print_err
   14: 
-  15: VALID_EXTENSIONS = ('.nwod', '.dnd3', '.dfrpg')
+  15: VALID_EXTENSIONS = ('.nwod', '', '.dfrpg')
   16: '''tuple: file extensions that should be parsed'''
   17: 
   18: DEPRECATED_TAGS = ('hidegroup', 'hideranks')
   19: 
--------------------------------------------------------------------------------
[0.00470 s] survived

   - [#  52] CRP parser: 
--------------------------------------------------------------------------------
   11: from pathlib import Path
   12: from npc import character
   13: from npc.util import print_err
   14: 
-  15: VALID_EXTENSIONS = ('.nwod', '.dnd3', '.dfrpg')
+  15: VALID_EXTENSIONS = ('.nwod', '.dnd3', 'mutpy')
   16: '''tuple: file extensions that should be parsed'''
   17: 
   18: DEPRECATED_TAGS = ('hidegroup', 'hideranks')
   19: 
--------------------------------------------------------------------------------
[0.00474 s] survived

   - [#  53] CRP parser: 
--------------------------------------------------------------------------------
   11: from pathlib import Path
   12: from npc import character
   13: from npc.util import print_err
   14: 
-  15: VALID_EXTENSIONS = ('.nwod', '.dnd3', '.dfrpg')
+  15: VALID_EXTENSIONS = ('.nwod', '.dnd3', '')
   16: '''tuple: file extensions that should be parsed'''
   17: 
   18: DEPRECATED_TAGS = ('hidegroup', 'hideranks')
   19: 
--------------------------------------------------------------------------------
[0.00467 s] survived

   - [#  54] CRP parser: 
--------------------------------------------------------------------------------
   12: from npc import character
   13: from npc.util import print_err
   14: 
   15: VALID_EXTENSIONS = ('.nwod', '.dnd3', '.dfrpg')
-  16: '''tuple: file extensions that should be parsed'''
+  16: '''mutpy'''
   17: 
   18: DEPRECATED_TAGS = ('hidegroup', 'hideranks')
   19: 
   20: SECTION_RE = re.compile('^--.+--\\s*$')
--------------------------------------------------------------------------------
[0.00472 s] survived

   - [#  55] CRP parser: 
--------------------------------------------------------------------------------
   12: from npc import character
   13: from npc.util import print_err
   14: 
   15: VALID_EXTENSIONS = ('.nwod', '.dnd3', '.dfrpg')
-  16: '''tuple: file extensions that should be parsed'''
+  16: ''''''
   17: 
   18: DEPRECATED_TAGS = ('hidegroup', 'hideranks')
   19: 
   20: SECTION_RE = re.compile('^--.+--\\s*$')
--------------------------------------------------------------------------------
[0.00478 s] survived

   - [#  56] CRP parser: 
--------------------------------------------------------------------------------
   14: 
   15: VALID_EXTENSIONS = ('.nwod', '.dnd3', '.dfrpg')
   16: '''tuple: file extensions that should be parsed'''
   17: 
-  18: DEPRECATED_TAGS = ('hidegroup', 'hideranks')
+  18: DEPRECATED_TAGS = ('mutpy', 'hideranks')
   19: 
   20: SECTION_RE = re.compile('^--.+--\\s*$')
   21: TAG_RE = re.compile('^@(?P<tag>#\\w+|\\w+)\\s+(?P<value>.*)$')
   22: HIDE_RE = re.compile('\\s*>>\\s*')
--------------------------------------------------------------------------------
[0.00472 s] survived

   - [#  57] CRP parser: 
--------------------------------------------------------------------------------
   14: 
   15: VALID_EXTENSIONS = ('.nwod', '.dnd3', '.dfrpg')
   16: '''tuple: file extensions that should be parsed'''
   17: 
-  18: DEPRECATED_TAGS = ('hidegroup', 'hideranks')
+  18: DEPRECATED_TAGS = ('', 'hideranks')
   19: 
   20: SECTION_RE = re.compile('^--.+--\\s*$')
   21: TAG_RE = re.compile('^@(?P<tag>#\\w+|\\w+)\\s+(?P<value>.*)$')
   22: HIDE_RE = re.compile('\\s*>>\\s*')
--------------------------------------------------------------------------------
[0.00467 s] survived

   - [#  58] CRP parser: 
--------------------------------------------------------------------------------
   14: 
   15: VALID_EXTENSIONS = ('.nwod', '.dnd3', '.dfrpg')
   16: '''tuple: file extensions that should be parsed'''
   17: 
-  18: DEPRECATED_TAGS = ('hidegroup', 'hideranks')
+  18: DEPRECATED_TAGS = ('hidegroup', 'mutpy')
   19: 
   20: SECTION_RE = re.compile('^--.+--\\s*$')
   21: TAG_RE = re.compile('^@(?P<tag>#\\w+|\\w+)\\s+(?P<value>.*)$')
   22: HIDE_RE = re.compile('\\s*>>\\s*')
--------------------------------------------------------------------------------
[0.00458 s] survived

   - [#  59] CRP parser: 
--------------------------------------------------------------------------------
   14: 
   15: VALID_EXTENSIONS = ('.nwod', '.dnd3', '.dfrpg')
   16: '''tuple: file extensions that should be parsed'''
   17: 
-  18: DEPRECATED_TAGS = ('hidegroup', 'hideranks')
+  18: DEPRECATED_TAGS = ('hidegroup', '')
   19: 
   20: SECTION_RE = re.compile('^--.+--\\s*$')
   21: TAG_RE = re.compile('^@(?P<tag>#\\w+|\\w+)\\s+(?P<value>.*)$')
   22: HIDE_RE = re.compile('\\s*>>\\s*')
--------------------------------------------------------------------------------
[0.00471 s] survived

   - [#  60] CRP parser: 
--------------------------------------------------------------------------------
   16: '''tuple: file extensions that should be parsed'''
   17: 
   18: DEPRECATED_TAGS = ('hidegroup', 'hideranks')
   19: 
-  20: SECTION_RE = re.compile('^--.+--\\s*$')
+  20: SECTION_RE = re.compile('mutpy')
   21: TAG_RE = re.compile('^@(?P<tag>#\\w+|\\w+)\\s+(?P<value>.*)$')
   22: HIDE_RE = re.compile('\\s*>>\\s*')
   23: 
   24: def get_characters(search_paths=None, ignore_paths=None):
--------------------------------------------------------------------------------
[0.00451 s] survived

   - [#  61] CRP parser: 
--------------------------------------------------------------------------------
   16: '''tuple: file extensions that should be parsed'''
   17: 
   18: DEPRECATED_TAGS = ('hidegroup', 'hideranks')
   19: 
-  20: SECTION_RE = re.compile('^--.+--\\s*$')
+  20: SECTION_RE = re.compile('')
   21: TAG_RE = re.compile('^@(?P<tag>#\\w+|\\w+)\\s+(?P<value>.*)$')
   22: HIDE_RE = re.compile('\\s*>>\\s*')
   23: 
   24: def get_characters(search_paths=None, ignore_paths=None):
--------------------------------------------------------------------------------
[0.00463 s] survived

   - [#  62] CRP parser: 
--------------------------------------------------------------------------------
   17: 
   18: DEPRECATED_TAGS = ('hidegroup', 'hideranks')
   19: 
   20: SECTION_RE = re.compile('^--.+--\\s*$')
-  21: TAG_RE = re.compile('^@(?P<tag>#\\w+|\\w+)\\s+(?P<value>.*)$')
+  21: TAG_RE = re.compile('mutpy')
   22: HIDE_RE = re.compile('\\s*>>\\s*')
   23: 
   24: def get_characters(search_paths=None, ignore_paths=None):
   25:     '''
--------------------------------------------------------------------------------
[0.00470 s] survived

   - [#  63] CRP parser: 
--------------------------------------------------------------------------------
   17: 
   18: DEPRECATED_TAGS = ('hidegroup', 'hideranks')
   19: 
   20: SECTION_RE = re.compile('^--.+--\\s*$')
-  21: TAG_RE = re.compile('^@(?P<tag>#\\w+|\\w+)\\s+(?P<value>.*)$')
+  21: TAG_RE = re.compile('')
   22: HIDE_RE = re.compile('\\s*>>\\s*')
   23: 
   24: def get_characters(search_paths=None, ignore_paths=None):
   25:     '''
--------------------------------------------------------------------------------
[0.00466 s] survived

   - [#  64] CRP parser: 
--------------------------------------------------------------------------------
   18: DEPRECATED_TAGS = ('hidegroup', 'hideranks')
   19: 
   20: SECTION_RE = re.compile('^--.+--\\s*$')
   21: TAG_RE = re.compile('^@(?P<tag>#\\w+|\\w+)\\s+(?P<value>.*)$')
-  22: HIDE_RE = re.compile('\\s*>>\\s*')
+  22: HIDE_RE = re.compile('mutpy')
   23: 
   24: def get_characters(search_paths=None, ignore_paths=None):
   25:     '''
   26:     Get data from character files
--------------------------------------------------------------------------------
[0.00474 s] survived

   - [#  65] CRP parser: 
--------------------------------------------------------------------------------
   18: DEPRECATED_TAGS = ('hidegroup', 'hideranks')
   19: 
   20: SECTION_RE = re.compile('^--.+--\\s*$')
   21: TAG_RE = re.compile('^@(?P<tag>#\\w+|\\w+)\\s+(?P<value>.*)$')
-  22: HIDE_RE = re.compile('\\s*>>\\s*')
+  22: HIDE_RE = re.compile('')
   23: 
   24: def get_characters(search_paths=None, ignore_paths=None):
   25:     '''
   26:     Get data from character files
--------------------------------------------------------------------------------
[0.00458 s] survived

   - [#  66] CRP parser: 
--------------------------------------------------------------------------------
   35:         List of Characters generated from every parseable character file within
   36:         every path of search_paths, but not in ignore_paths.
   37:     '''
   38:     if search_paths is None:
-  39:         search_paths = ['.']
+  39:         search_paths = ['mutpy']
   40:     
   41:     if ignore_paths:
   42:         ignore_paths[:] = [path.normpath(d) for d in ignore_paths]
   43:     
--------------------------------------------------------------------------------
[0.00462 s] survived

   - [#  67] CRP parser: 
--------------------------------------------------------------------------------
   35:         List of Characters generated from every parseable character file within
   36:         every path of search_paths, but not in ignore_paths.
   37:     '''
   38:     if search_paths is None:
-  39:         search_paths = ['.']
+  39:         search_paths = ['']
   40:     
   41:     if ignore_paths:
   42:         ignore_paths[:] = [path.normpath(d) for d in ignore_paths]
   43:     
--------------------------------------------------------------------------------
[0.00415 s] survived

   - [#  68] CRP parser: 
--------------------------------------------------------------------------------
  122:     '''
  123:     
  124:     
  125:     basename = path.basename(char_file_path)
- 126:     name = path.splitext(basename)[0].split(' - ', 1)[0]
+ 126:     name = path.splitext(basename)[1].split(' - ', 1)[0]
  127:     
  128:     
  129:     parsed_char = character.Character(name=\
  130:         [name], path=\
--------------------------------------------------------------------------------
[0.00472 s] survived

   - [#  69] CRP parser: 
--------------------------------------------------------------------------------
  122:     '''
  123:     
  124:     
  125:     basename = path.basename(char_file_path)
- 126:     name = path.splitext(basename)[0].split(' - ', 1)[0]
+ 126:     name = path.splitext(basename)[0].split('mutpy', 1)[0]
  127:     
  128:     
  129:     parsed_char = character.Character(name=\
  130:         [name], path=\
--------------------------------------------------------------------------------
[0.00446 s] survived

   - [#  70] CRP parser: 
--------------------------------------------------------------------------------
  122:     '''
  123:     
  124:     
  125:     basename = path.basename(char_file_path)
- 126:     name = path.splitext(basename)[0].split(' - ', 1)[0]
+ 126:     name = path.splitext(basename)[0].split('', 1)[0]
  127:     
  128:     
  129:     parsed_char = character.Character(name=\
  130:         [name], path=\
--------------------------------------------------------------------------------
[0.00455 s] survived

   - [#  71] CRP parser: 
--------------------------------------------------------------------------------
  122:     '''
  123:     
  124:     
  125:     basename = path.basename(char_file_path)
- 126:     name = path.splitext(basename)[0].split(' - ', 1)[0]
+ 126:     name = path.splitext(basename)[0].split(' - ', 2)[0]
  127:     
  128:     
  129:     parsed_char = character.Character(name=\
  130:         [name], path=\
--------------------------------------------------------------------------------
[0.00459 s] survived

   - [#  72] CRP parser: 
--------------------------------------------------------------------------------
  122:     '''
  123:     
  124:     
  125:     basename = path.basename(char_file_path)
- 126:     name = path.splitext(basename)[0].split(' - ', 1)[0]
+ 126:     name = path.splitext(basename)[0].split(' - ', 1)[1]
  127:     
  128:     
  129:     parsed_char = character.Character(name=\
  130:         [name], path=\
--------------------------------------------------------------------------------
[0.00465 s] survived

   - [#  73] CRP parser: 
--------------------------------------------------------------------------------
  130:         [name], path=\
  131:         char_file_path)
  132:     
  133:     
- 134:     with open(char_file_path, 'r') as char_file:
+ 134:     with open(char_file_path, 'mutpy') as char_file:
  135:         subtag_registry = {}
  136:         previous_line_empty = False
  137:         
  138:         for line in char_file:
--------------------------------------------------------------------------------
[0.00470 s] survived

   - [#  74] CRP parser: 
--------------------------------------------------------------------------------
  130:         [name], path=\
  131:         char_file_path)
  132:     
  133:     
- 134:     with open(char_file_path, 'r') as char_file:
+ 134:     with open(char_file_path, '') as char_file:
  135:         subtag_registry = {}
  136:         previous_line_empty = False
  137:         
  138:         for line in char_file:
--------------------------------------------------------------------------------
[0.00456 s] survived

   - [#  75] CRP parser: 
--------------------------------------------------------------------------------
  141:                 break
  142:             
  143:             match = TAG_RE.match(line)
  144:             if match:
- 145:                 tag = match.group('tag').lower()
+ 145:                 tag = match.group('mutpy').lower()
  146:                 value = match.group('value')
  147:                 
  148:                 
  149:                 if tag[0] == '#':
--------------------------------------------------------------------------------
[0.00459 s] survived

   - [#  76] CRP parser: 
--------------------------------------------------------------------------------
  141:                 break
  142:             
  143:             match = TAG_RE.match(line)
  144:             if match:
- 145:                 tag = match.group('tag').lower()
+ 145:                 tag = match.group('').lower()
  146:                 value = match.group('value')
  147:                 
  148:                 
  149:                 if tag[0] == '#':
--------------------------------------------------------------------------------
[0.00478 s] survived

   - [#  77] CRP parser: 
--------------------------------------------------------------------------------
  142:             
  143:             match = TAG_RE.match(line)
  144:             if match:
  145:                 tag = match.group('tag').lower()
- 146:                 value = match.group('value')
+ 146:                 value = match.group('mutpy')
  147:                 
  148:                 
  149:                 if tag[0] == '#':
  150:                     continue
--------------------------------------------------------------------------------
[0.00460 s] survived

   - [#  78] CRP parser: 
--------------------------------------------------------------------------------
  142:             
  143:             match = TAG_RE.match(line)
  144:             if match:
  145:                 tag = match.group('tag').lower()
- 146:                 value = match.group('value')
+ 146:                 value = match.group('')
  147:                 
  148:                 
  149:                 if tag[0] == '#':
  150:                     continue
--------------------------------------------------------------------------------
[0.00474 s] survived

   - [#  79] CRP parser: 
--------------------------------------------------------------------------------
  145:                 tag = match.group('tag').lower()
  146:                 value = match.group('value')
  147:                 
  148:                 
- 149:                 if tag[0] == '#':
+ 149:                 if tag[1] == '#':
  150:                     continue
  151:                 
  152:                 
  153:                 if tag == 'changeling':
--------------------------------------------------------------------------------
[0.00462 s] survived

   - [#  80] CRP parser: 
--------------------------------------------------------------------------------
  145:                 tag = match.group('tag').lower()
  146:                 value = match.group('value')
  147:                 
  148:                 
- 149:                 if tag[0] == '#':
+ 149:                 if tag[0] == 'mutpy':
  150:                     continue
  151:                 
  152:                 
  153:                 if tag == 'changeling':
--------------------------------------------------------------------------------
[0.00467 s] survived

   - [#  81] CRP parser: 
--------------------------------------------------------------------------------
  145:                 tag = match.group('tag').lower()
  146:                 value = match.group('value')
  147:                 
  148:                 
- 149:                 if tag[0] == '#':
+ 149:                 if tag[0] == '':
  150:                     continue
  151:                 
  152:                 
  153:                 if tag == 'changeling':
--------------------------------------------------------------------------------
[0.00465 s] survived

   - [#  82] CRP parser: 
--------------------------------------------------------------------------------
  149:                 if tag[0] == '#':
  150:                     continue
  151:                 
  152:                 
- 153:                 if tag == 'changeling':
+ 153:                 if tag == 'mutpy':
  154:                     
  155:                     bits = value.split(maxsplit=1)
  156:                     parsed_char.tags('type').append('Changeling')
  157:                     if len(bits):
--------------------------------------------------------------------------------
[0.00467 s] survived

   - [#  83] CRP parser: 
--------------------------------------------------------------------------------
  149:                 if tag[0] == '#':
  150:                     continue
  151:                 
  152:                 
- 153:                 if tag == 'changeling':
+ 153:                 if tag == '':
  154:                     
  155:                     bits = value.split(maxsplit=1)
  156:                     parsed_char.tags('type').append('Changeling')
  157:                     if len(bits):
--------------------------------------------------------------------------------
[0.00459 s] survived

   - [#  84] CRP parser: 
--------------------------------------------------------------------------------
  151:                 
  152:                 
  153:                 if tag == 'changeling':
  154:                     
- 155:                     bits = value.split(maxsplit=1)
+ 155:                     bits = value.split(maxsplit=2)
  156:                     parsed_char.tags('type').append('Changeling')
  157:                     if len(bits):
  158:                         parsed_char.tags('seeming').append(bits[0])
  159:                     if len(bits) > 1:
--------------------------------------------------------------------------------
[0.00459 s] survived

   - [#  85] CRP parser: 
--------------------------------------------------------------------------------
  152:                 
  153:                 if tag == 'changeling':
  154:                     
  155:                     bits = value.split(maxsplit=1)
- 156:                     parsed_char.tags('type').append('Changeling')
+ 156:                     parsed_char.tags('mutpy').append('Changeling')
  157:                     if len(bits):
  158:                         parsed_char.tags('seeming').append(bits[0])
  159:                     if len(bits) > 1:
  160:                         parsed_char.tags('kith').append(bits[1])
--------------------------------------------------------------------------------
[0.00480 s] survived

   - [#  86] CRP parser: 
--------------------------------------------------------------------------------
  152:                 
  153:                 if tag == 'changeling':
  154:                     
  155:                     bits = value.split(maxsplit=1)
- 156:                     parsed_char.tags('type').append('Changeling')
+ 156:                     parsed_char.tags('').append('Changeling')
  157:                     if len(bits):
  158:                         parsed_char.tags('seeming').append(bits[0])
  159:                     if len(bits) > 1:
  160:                         parsed_char.tags('kith').append(bits[1])
--------------------------------------------------------------------------------
[0.00452 s] survived

   - [#  87] CRP parser: 
--------------------------------------------------------------------------------
  152:                 
  153:                 if tag == 'changeling':
  154:                     
  155:                     bits = value.split(maxsplit=1)
- 156:                     parsed_char.tags('type').append('Changeling')
+ 156:                     parsed_char.tags('type').append('mutpy')
  157:                     if len(bits):
  158:                         parsed_char.tags('seeming').append(bits[0])
  159:                     if len(bits) > 1:
  160:                         parsed_char.tags('kith').append(bits[1])
--------------------------------------------------------------------------------
[0.00470 s] survived

   - [#  88] CRP parser: 
--------------------------------------------------------------------------------
  152:                 
  153:                 if tag == 'changeling':
  154:                     
  155:                     bits = value.split(maxsplit=1)
- 156:                     parsed_char.tags('type').append('Changeling')
+ 156:                     parsed_char.tags('type').append('')
  157:                     if len(bits):
  158:                         parsed_char.tags('seeming').append(bits[0])
  159:                     if len(bits) > 1:
  160:                         parsed_char.tags('kith').append(bits[1])
--------------------------------------------------------------------------------
[0.00455 s] survived

   - [#  89] CRP parser: 
--------------------------------------------------------------------------------
  154:                     
  155:                     bits = value.split(maxsplit=1)
  156:                     parsed_char.tags('type').append('Changeling')
  157:                     if len(bits):
- 158:                         parsed_char.tags('seeming').append(bits[0])
+ 158:                         parsed_char.tags('mutpy').append(bits[0])
  159:                     if len(bits) > 1:
  160:                         parsed_char.tags('kith').append(bits[1])
  161:                     continue
  162:                 elif tag == 'werewolf':
--------------------------------------------------------------------------------
[0.00473 s] survived

   - [#  90] CRP parser: 
--------------------------------------------------------------------------------
  154:                     
  155:                     bits = value.split(maxsplit=1)
  156:                     parsed_char.tags('type').append('Changeling')
  157:                     if len(bits):
- 158:                         parsed_char.tags('seeming').append(bits[0])
+ 158:                         parsed_char.tags('').append(bits[0])
  159:                     if len(bits) > 1:
  160:                         parsed_char.tags('kith').append(bits[1])
  161:                     continue
  162:                 elif tag == 'werewolf':
--------------------------------------------------------------------------------
[0.00456 s] survived

   - [#  91] CRP parser: 
--------------------------------------------------------------------------------
  154:                     
  155:                     bits = value.split(maxsplit=1)
  156:                     parsed_char.tags('type').append('Changeling')
  157:                     if len(bits):
- 158:                         parsed_char.tags('seeming').append(bits[0])
+ 158:                         parsed_char.tags('seeming').append(bits[1])
  159:                     if len(bits) > 1:
  160:                         parsed_char.tags('kith').append(bits[1])
  161:                     continue
  162:                 elif tag == 'werewolf':
--------------------------------------------------------------------------------
[0.00460 s] survived

   - [#  92] CRP parser: 
--------------------------------------------------------------------------------
  155:                     bits = value.split(maxsplit=1)
  156:                     parsed_char.tags('type').append('Changeling')
  157:                     if len(bits):
  158:                         parsed_char.tags('seeming').append(bits[0])
- 159:                     if len(bits) > 1:
+ 159:                     if len(bits) > 2:
  160:                         parsed_char.tags('kith').append(bits[1])
  161:                     continue
  162:                 elif tag == 'werewolf':
  163:                     parsed_char.tags('type').append('Werewolf')
--------------------------------------------------------------------------------
[0.00463 s] survived

   - [#  93] CRP parser: 
--------------------------------------------------------------------------------
  156:                     parsed_char.tags('type').append('Changeling')
  157:                     if len(bits):
  158:                         parsed_char.tags('seeming').append(bits[0])
  159:                     if len(bits) > 1:
- 160:                         parsed_char.tags('kith').append(bits[1])
+ 160:                         parsed_char.tags('mutpy').append(bits[1])
  161:                     continue
  162:                 elif tag == 'werewolf':
  163:                     parsed_char.tags('type').append('Werewolf')
  164:                     parsed_char.tags('auspice').append(value)
--------------------------------------------------------------------------------
[0.00461 s] survived

   - [#  94] CRP parser: 
--------------------------------------------------------------------------------
  156:                     parsed_char.tags('type').append('Changeling')
  157:                     if len(bits):
  158:                         parsed_char.tags('seeming').append(bits[0])
  159:                     if len(bits) > 1:
- 160:                         parsed_char.tags('kith').append(bits[1])
+ 160:                         parsed_char.tags('').append(bits[1])
  161:                     continue
  162:                 elif tag == 'werewolf':
  163:                     parsed_char.tags('type').append('Werewolf')
  164:                     parsed_char.tags('auspice').append(value)
--------------------------------------------------------------------------------
[0.00475 s] survived

   - [#  95] CRP parser: 
--------------------------------------------------------------------------------
  156:                     parsed_char.tags('type').append('Changeling')
  157:                     if len(bits):
  158:                         parsed_char.tags('seeming').append(bits[0])
  159:                     if len(bits) > 1:
- 160:                         parsed_char.tags('kith').append(bits[1])
+ 160:                         parsed_char.tags('kith').append(bits[2])
  161:                     continue
  162:                 elif tag == 'werewolf':
  163:                     parsed_char.tags('type').append('Werewolf')
  164:                     parsed_char.tags('auspice').append(value)
--------------------------------------------------------------------------------
[0.00466 s] survived
