   - [#  96] CRP parser: 
--------------------------------------------------------------------------------
  158:                         parsed_char.tags('seeming').append(bits[0])
  159:                     if len(bits) > 1:
  160:                         parsed_char.tags('kith').append(bits[1])
  161:                     continue
- 162:                 elif tag == 'werewolf':
+ 162:                 elif tag == 'mutpy':
  163:                     parsed_char.tags('type').append('Werewolf')
  164:                     parsed_char.tags('auspice').append(value)
  165:                     continue
  166:                 
--------------------------------------------------------------------------------
[0.00465 s] survived

   - [#  97] CRP parser: 
--------------------------------------------------------------------------------
  158:                         parsed_char.tags('seeming').append(bits[0])
  159:                     if len(bits) > 1:
  160:                         parsed_char.tags('kith').append(bits[1])
  161:                     continue
- 162:                 elif tag == 'werewolf':
+ 162:                 elif tag == '':
  163:                     parsed_char.tags('type').append('Werewolf')
  164:                     parsed_char.tags('auspice').append(value)
  165:                     continue
  166:                 
--------------------------------------------------------------------------------
[0.00459 s] survived

   - [#  98] CRP parser: 
--------------------------------------------------------------------------------
  159:                     if len(bits) > 1:
  160:                         parsed_char.tags('kith').append(bits[1])
  161:                     continue
  162:                 elif tag == 'werewolf':
- 163:                     parsed_char.tags('type').append('Werewolf')
+ 163:                     parsed_char.tags('mutpy').append('Werewolf')
  164:                     parsed_char.tags('auspice').append(value)
  165:                     continue
  166:                 
  167:                 
--------------------------------------------------------------------------------
[0.00482 s] survived

   - [#  99] CRP parser: 
--------------------------------------------------------------------------------
  159:                     if len(bits) > 1:
  160:                         parsed_char.tags('kith').append(bits[1])
  161:                     continue
  162:                 elif tag == 'werewolf':
- 163:                     parsed_char.tags('type').append('Werewolf')
+ 163:                     parsed_char.tags('').append('Werewolf')
  164:                     parsed_char.tags('auspice').append(value)
  165:                     continue
  166:                 
  167:                 
--------------------------------------------------------------------------------
[0.00465 s] survived

   - [# 100] CRP parser: 
--------------------------------------------------------------------------------
  159:                     if len(bits) > 1:
  160:                         parsed_char.tags('kith').append(bits[1])
  161:                     continue
  162:                 elif tag == 'werewolf':
- 163:                     parsed_char.tags('type').append('Werewolf')
+ 163:                     parsed_char.tags('type').append('mutpy')
  164:                     parsed_char.tags('auspice').append(value)
  165:                     continue
  166:                 
  167:                 
--------------------------------------------------------------------------------
[0.00461 s] survived

   - [# 101] CRP parser: 
--------------------------------------------------------------------------------
  159:                     if len(bits) > 1:
  160:                         parsed_char.tags('kith').append(bits[1])
  161:                     continue
  162:                 elif tag == 'werewolf':
- 163:                     parsed_char.tags('type').append('Werewolf')
+ 163:                     parsed_char.tags('type').append('')
  164:                     parsed_char.tags('auspice').append(value)
  165:                     continue
  166:                 
  167:                 
--------------------------------------------------------------------------------
[0.00472 s] survived

   - [# 102] CRP parser: 
--------------------------------------------------------------------------------
  160:                         parsed_char.tags('kith').append(bits[1])
  161:                     continue
  162:                 elif tag == 'werewolf':
  163:                     parsed_char.tags('type').append('Werewolf')
- 164:                     parsed_char.tags('auspice').append(value)
+ 164:                     parsed_char.tags('mutpy').append(value)
  165:                     continue
  166:                 
  167:                 
  168:                 if tag == 'realname':
--------------------------------------------------------------------------------
[0.00455 s] survived

   - [# 103] CRP parser: 
--------------------------------------------------------------------------------
  160:                         parsed_char.tags('kith').append(bits[1])
  161:                     continue
  162:                 elif tag == 'werewolf':
  163:                     parsed_char.tags('type').append('Werewolf')
- 164:                     parsed_char.tags('auspice').append(value)
+ 164:                     parsed_char.tags('').append(value)
  165:                     continue
  166:                 
  167:                 
  168:                 if tag == 'realname':
--------------------------------------------------------------------------------
[0.00462 s] survived

   - [# 104] CRP parser: 
--------------------------------------------------------------------------------
  164:                     parsed_char.tags('auspice').append(value)
  165:                     continue
  166:                 
  167:                 
- 168:                 if tag == 'realname':
+ 168:                 if tag == 'mutpy':
  169:                     parsed_char.tags('name')[0] = value
  170:                     continue
  171:                 
  172:                 
--------------------------------------------------------------------------------
[0.00470 s] survived

   - [# 105] CRP parser: 
--------------------------------------------------------------------------------
  164:                     parsed_char.tags('auspice').append(value)
  165:                     continue
  166:                 
  167:                 
- 168:                 if tag == 'realname':
+ 168:                 if tag == '':
  169:                     parsed_char.tags('name')[0] = value
  170:                     continue
  171:                 
  172:                 
--------------------------------------------------------------------------------
[0.00461 s] survived

   - [# 106] CRP parser: 
--------------------------------------------------------------------------------
  165:                     continue
  166:                 
  167:                 
  168:                 if tag == 'realname':
- 169:                     parsed_char.tags('name')[0] = value
+ 169:                     parsed_char.tags('mutpy')[0] = value
  170:                     continue
  171:                 
  172:                 
  173:                 if parsed_char.tags(tag).subtag_name:
--------------------------------------------------------------------------------
[0.00454 s] survived

   - [# 107] CRP parser: 
--------------------------------------------------------------------------------
  165:                     continue
  166:                 
  167:                 
  168:                 if tag == 'realname':
- 169:                     parsed_char.tags('name')[0] = value
+ 169:                     parsed_char.tags('')[0] = value
  170:                     continue
  171:                 
  172:                 
  173:                 if parsed_char.tags(tag).subtag_name:
--------------------------------------------------------------------------------
[0.00462 s] survived

   - [# 108] CRP parser: 
--------------------------------------------------------------------------------
  165:                     continue
  166:                 
  167:                 
  168:                 if tag == 'realname':
- 169:                     parsed_char.tags('name')[0] = value
+ 169:                     parsed_char.tags('name')[1] = value
  170:                     continue
  171:                 
  172:                 
  173:                 if parsed_char.tags(tag).subtag_name:
--------------------------------------------------------------------------------
[0.00468 s] survived

   - [# 109] CRP parser: 
--------------------------------------------------------------------------------
  177:                     parsed_char.tags(supertag)[supervalue].append(value)
  178:                     continue
  179:                 
  180:                 
- 181:                 if tag == 'hide':
+ 181:                 if tag == 'mutpy':
  182:                     parts = HIDE_RE.split(value)
  183:                     
  184:                     tagname = parts.pop(0)
  185:                     if not parts:
--------------------------------------------------------------------------------
[0.00469 s] survived

   - [# 110] CRP parser: 
--------------------------------------------------------------------------------
  177:                     parsed_char.tags(supertag)[supervalue].append(value)
  178:                     continue
  179:                 
  180:                 
- 181:                 if tag == 'hide':
+ 181:                 if tag == '':
  182:                     parts = HIDE_RE.split(value)
  183:                     
  184:                     tagname = parts.pop(0)
  185:                     if not parts:
--------------------------------------------------------------------------------
[0.00463 s] survived

   - [# 111] CRP parser: 
--------------------------------------------------------------------------------
  180:                 
  181:                 if tag == 'hide':
  182:                     parts = HIDE_RE.split(value)
  183:                     
- 184:                     tagname = parts.pop(0)
+ 184:                     tagname = parts.pop(1)
  185:                     if not parts:
  186:                         parsed_char.tags(tagname).hidden = True
  187:                         continue
  188:                     
--------------------------------------------------------------------------------
[0.00483 s] survived

   - [# 112] CRP parser: 
--------------------------------------------------------------------------------
  185:                     if not parts:
  186:                         parsed_char.tags(tagname).hidden = True
  187:                         continue
  188:                     
- 189:                     first_value = parts.pop(0)
+ 189:                     first_value = parts.pop(1)
  190:                     if not parts:
  191:                         parsed_char.tags(tagname).hide_value(first_value)
  192:                         continue
  193:                     
--------------------------------------------------------------------------------
[0.00470 s] survived

   - [# 113] CRP parser: 
--------------------------------------------------------------------------------
  190:                     if not parts:
  191:                         parsed_char.tags(tagname).hide_value(first_value)
  192:                         continue
  193:                     
- 194:                     second_value = parts.pop(0)
+ 194:                     second_value = parts.pop(1)
  195:                     if not parts:
  196:                         if second_value == 'subtags':
  197:                             parsed_char.tags(tagname).subtag(first_value).hidden = True
  198:                         else:
--------------------------------------------------------------------------------
[0.00466 s] survived

   - [# 114] CRP parser: 
--------------------------------------------------------------------------------
  192:                         continue
  193:                     
  194:                     second_value = parts.pop(0)
  195:                     if not parts:
- 196:                         if second_value == 'subtags':
+ 196:                         if second_value == 'mutpy':
  197:                             parsed_char.tags(tagname).subtag(first_value).hidden = True
  198:                         else:
  199:                             parsed_char.tags(tagname).subtag(first_value).hide_value(second_value)
  200:                         continue
--------------------------------------------------------------------------------
[0.00466 s] survived

   - [# 115] CRP parser: 
--------------------------------------------------------------------------------
  192:                         continue
  193:                     
  194:                     second_value = parts.pop(0)
  195:                     if not parts:
- 196:                         if second_value == 'subtags':
+ 196:                         if second_value == '':
  197:                             parsed_char.tags(tagname).subtag(first_value).hidden = True
  198:                         else:
  199:                             parsed_char.tags(tagname).subtag(first_value).hide_value(second_value)
  200:                         continue
--------------------------------------------------------------------------------
[0.00474 s] survived

   - [# 116] CRP parser: 
--------------------------------------------------------------------------------
  204:                     parsed_char.tags(value).hidden = True
  205:                     continue
  206:                 
  207:                 if tag in DEPRECATED_TAGS:
- 208:                     print_err("The tag '{}' in `{}` is deprecated and will stop working in the future".format(tag, char_file_path))
+ 208:                     print_err('mutpy'.format(tag, char_file_path))
  209:                 
  210:                 parsed_char.tags(tag).append(value)
  211:             else:
  212:                 
--------------------------------------------------------------------------------
[0.00486 s] survived

   - [# 117] CRP parser: 
--------------------------------------------------------------------------------
  204:                     parsed_char.tags(value).hidden = True
  205:                     continue
  206:                 
  207:                 if tag in DEPRECATED_TAGS:
- 208:                     print_err("The tag '{}' in `{}` is deprecated and will stop working in the future".format(tag, char_file_path))
+ 208:                     print_err(''.format(tag, char_file_path))
  209:                 
  210:                 parsed_char.tags(tag).append(value)
  211:             else:
  212:                 
--------------------------------------------------------------------------------
[0.00479 s] survived

   - [# 118] CRP parser: 
--------------------------------------------------------------------------------
  209:                 
  210:                 parsed_char.tags(tag).append(value)
  211:             else:
  212:                 
- 213:                 if line == '\n':
+ 213:                 if line == 'mutpy':
  214:                     if previous_line_empty:
  215:                         continue
  216:                     else:
  217:                         previous_line_empty = True
--------------------------------------------------------------------------------
[0.00461 s] survived

   - [# 119] CRP parser: 
--------------------------------------------------------------------------------
  209:                 
  210:                 parsed_char.tags(tag).append(value)
  211:             else:
  212:                 
- 213:                 if line == '\n':
+ 213:                 if line == '':
  214:                     if previous_line_empty:
  215:                         continue
  216:                     else:
  217:                         previous_line_empty = True
--------------------------------------------------------------------------------
[0.00470 s] survived

   - [# 120] CRP parser: 
--------------------------------------------------------------------------------
  218:                 else:
  219:                     previous_line_empty = False
  220:                 
  221:                 
- 222:                 parsed_char.tags('description').append(line.strip())
+ 222:                 parsed_char.tags('mutpy').append(line.strip())
  223:                 continue
  224:     
  225:     return character.build(other_char=parsed_char)
--------------------------------------------------------------------------------
[0.00468 s] survived

   - [# 121] CRP parser: 
--------------------------------------------------------------------------------
  218:                 else:
  219:                     previous_line_empty = False
  220:                 
  221:                 
- 222:                 parsed_char.tags('description').append(line.strip())
+ 222:                 parsed_char.tags('').append(line.strip())
  223:                 continue
  224:     
  225:     return character.build(other_char=parsed_char)
--------------------------------------------------------------------------------
[0.00474 s] survived
